import pkg from '@whiskeysockets/baileys';
const { generateWAMessageFromContent, proto, prepareWAMessageMedia } = pkg

var handler = async (m, { conn, usedPrefix }) => {
const tips = [
"𝚜𝚑𝚎 𝚠𝚊𝚜 𝚙𝚘𝚎𝚝𝚛𝚢 𝚒𝚗 𝚊 𝚠𝚘𝚛𝚕𝚍 𝚜𝚝𝚒𝚕𝚕 𝚕𝚎𝚊𝚛𝚗𝚒𝚗𝚐 𝚝𝚑𝚎 𝚊𝚕𝚙𝚑𝚊𝚋𝚎𝚝",
"𝚒’𝚖 𝚗𝚘𝚝 𝚋𝚛𝚘𝚔𝚎𝚗, 𝚒’𝚖 𝚓𝚞𝚜𝚝 𝚊 𝚕𝚒𝚖𝚒𝚝𝚎𝚍 𝚎𝚍𝚒𝚝𝚒𝚘𝚗",
"𝚜𝚑𝚎’𝚜 𝚠𝚑𝚒𝚜𝚔𝚎𝚢 𝚒𝚗 𝚊 𝚝𝚎𝚊𝚌𝚞𝚙",
"𝚒 𝚍𝚘𝚗’𝚝 𝚌𝚑𝚊𝚜𝚎, 𝚒 𝚊𝚝𝚝𝚛𝚊𝚌𝚝",
"𝚢𝚘𝚞𝚛 𝚕𝚘𝚜𝚜, 𝚋𝚊𝚋𝚎",
"𝚝𝚘𝚘 𝚐𝚕𝚊𝚖 𝚝𝚘 𝚐𝚒𝚟𝚎 𝚊 𝚍𝚊𝚖𝚗",
"𝚚𝚞𝚎𝚎𝚗 𝚠𝚒𝚝𝚑𝚘𝚞𝚝 𝚊 𝚔𝚒𝚗𝚐, 𝚜𝚝𝚒𝚕𝚕 𝚛𝚞𝚕𝚒𝚗𝚐",
"𝚖𝚢 𝚜𝚒𝚕𝚎𝚗𝚌𝚎 𝚒𝚜 𝚕𝚘𝚞𝚍𝚎𝚛 𝚝𝚑𝚊𝚗 𝚢𝚘𝚞𝚛 𝚠𝚘𝚛𝚍𝚜",
"𝚒’𝚖 𝚝𝚑𝚎 𝚎𝚡𝚌𝚎𝚙𝚝𝚒𝚘𝚗",
"𝚜𝚑𝚎 𝚋𝚞𝚒𝚕𝚝 𝚊𝚗 𝚎𝚖𝚙𝚒𝚛𝚎 𝚠𝚒𝚝𝚑 𝚝𝚑𝚎 𝚋𝚛𝚒𝚌𝚔𝚜 𝚝𝚑𝚎𝚢 𝚝𝚑𝚛𝚎𝚠",
"𝚗𝚘𝚘𝚝 𝚏𝚛𝚊𝚐𝚒𝚕𝚎 𝚕𝚒𝚔𝚎 𝚊 𝚏𝚕𝚘𝚠𝚎𝚛, 𝚏𝚛𝚊𝚐𝚒𝚕𝚎 𝚕𝚒𝚔𝚎 𝚊 𝚋𝚘𝚖𝚋",
"𝚒 𝚍𝚘𝚗’𝚝 𝚗𝚎𝚎𝚍 𝚢𝚘𝚞𝚛 𝚊𝚙𝚙𝚛𝚘𝚟𝚊𝚕",
"𝚜𝚑𝚎’𝚜 𝚊 𝚖𝚎𝚜𝚜 𝚘𝚏 𝚐𝚘𝚛𝚐𝚎𝚘𝚞𝚜 𝚌𝚑𝚊𝚘𝚜",
"𝚖𝚊𝚍𝚎 𝚘𝚏 𝚜𝚝𝚊𝚛𝚍𝚞𝚜𝚝 𝚊𝚗𝚍 𝚜𝚊𝚟𝚊𝚐𝚎𝚛𝚢",
"𝚒’𝚖 𝚗𝚘𝚝 𝚊𝚗𝚝𝚒-𝚜𝚘𝚌𝚒𝚊𝚕, 𝚒’𝚖 𝚜𝚎𝚕𝚎𝚌𝚝𝚒𝚟𝚎𝚕𝚢 𝚜𝚘𝚌𝚒𝚊𝚕",
"𝚜𝚑𝚎 𝚠𝚊𝚕𝚔𝚜 𝚕𝚒𝚔𝚎 𝚛𝚊𝚒𝚗 𝚊𝚗𝚍 𝚕𝚘𝚟𝚎𝚜 𝚕𝚒𝚔𝚎 𝚏𝚒𝚛𝚎",
"𝚒’𝚖 𝚝𝚑𝚎 𝚟𝚒𝚋𝚎 𝚢𝚘𝚞 𝚌𝚊𝚗’𝚝 𝚏𝚒𝚗𝚍 𝚝𝚠𝚒𝚌𝚎",
"𝚜𝚞𝚗𝚜𝚑𝚒𝚗𝚎 𝚖𝚒𝚡𝚎𝚍 𝚠𝚒𝚝𝚑 𝚊 𝚕𝚒𝚝𝚝𝚕𝚎 𝚑𝚞𝚛𝚛𝚒𝚌𝚊𝚗𝚎",
"𝚔𝚒𝚕𝚕 𝚝𝚑𝚎𝚖 𝚠𝚒𝚝𝚑 𝚜𝚞𝚌𝚌𝚎𝚜𝚜, 𝚋𝚞𝚛𝚢 𝚝𝚑𝚎𝚖 𝚠𝚒𝚝𝚑 𝚊 𝚜𝚖𝚒𝚕𝚎",
"𝚒 𝚍𝚘𝚗’𝚝 𝚏𝚘𝚕𝚕𝚘𝚠 𝚛𝚞𝚕𝚎𝚜, 𝚒 𝚖𝚊𝚔𝚎 𝚝𝚑𝚎𝚖",
"𝚜𝚑𝚎’𝚜 𝚊 𝚠𝚘𝚕𝚏 𝚒𝚗 𝚍𝚎𝚜𝚒𝚐𝚗𝚎𝚛",
"𝚖𝚢 𝚑𝚎𝚎𝚕𝚜 𝚊𝚛𝚎 𝚑𝚒𝚐𝚑𝚎𝚛 𝚝𝚑𝚊𝚗 𝚢𝚘𝚞𝚛 𝚜𝚝𝚊𝚗𝚍𝚊𝚛𝚍𝚜",
"𝚒’𝚖 𝚗𝚘𝚝 𝚌𝚘𝚕𝚍, 𝚒’𝚖 𝚓𝚞𝚜𝚝 𝚍𝚘𝚗𝚎 𝚠𝚒𝚝𝚑 𝚝𝚑𝚎 𝚋𝚞𝚕𝚕𝚜𝚑𝚒𝚝",
"𝚜𝚑𝚎 𝚛𝚎𝚖𝚎𝚖𝚋𝚎𝚛𝚎𝚍 𝚠𝚑𝚘 𝚜𝚑𝚎 𝚠𝚊𝚜 𝚊𝚗𝚍 𝚝𝚑𝚎 𝚐𝚊𝚖𝚎 𝚌𝚑𝚊𝚗𝚐𝚎𝚍",
"𝚒 𝚒 𝚊𝚖 𝚝𝚑𝚎 𝚜𝚝𝚘𝚛𝚖 𝚢𝚘𝚞 𝚠𝚎𝚛𝚎 𝚠𝚊𝚛𝚗𝚎𝚍 𝚊𝚋𝚘𝚞𝚝",
"𝚜𝚑𝚎’𝚜 𝚊𝚗 𝚊𝚛𝚝 𝚙𝚒𝚎𝚌𝚎 𝚢𝚘𝚞 𝚌𝚊𝚗’𝚝 𝚊𝚏𝚏𝚘𝚛𝚍",
"𝚒 𝚍𝚘𝚗’𝚝 𝚑𝚊𝚝𝚎 𝚢𝚘𝚞, 𝚒’𝚖 𝚓𝚞𝚜𝚝 𝚗𝚘𝚝 𝚎𝚡𝚌𝚒𝚝𝚎𝚍 𝚊𝚋𝚘𝚞𝚝 𝚢𝚘𝚞𝚛 𝚎𝚡𝚒𝚜𝚝𝚎𝚗𝚌𝚎",
"𝚜𝚑𝚎’𝚜 𝚝𝚑𝚎 𝚔𝚒𝚗𝚍 𝚘𝚏 𝚚𝚞𝚎𝚎𝚗 𝚝𝚑𝚊𝚝 𝚔𝚗𝚘𝚠𝚜 𝚑𝚎𝚛 𝚌𝚛𝚘𝚠𝚗 𝚒𝚜𝚗’𝚝 𝚘𝚗 𝚑𝚎𝚛 𝚑𝚎𝚊𝚍 𝚋𝚞𝚝 𝚒𝚗 𝚑𝚎𝚛 𝚜𝚘𝚞𝚕",
"𝚒’𝚖 𝚗𝚘𝚗𝚕𝚢 𝚛𝚎𝚜𝚙𝚘𝚗𝚜𝚒𝚋𝚕𝚎 𝚏𝚘𝚛 𝚠𝚑𝚊𝚝 𝚒 𝚜𝚊𝚢, 𝚗𝚘𝚝 𝚏𝚘𝚛 𝚠𝚑𝚊𝚝 𝚢𝚘𝚞 𝚞𝚗𝚍𝚎𝚛𝚜𝚝𝚊𝚗𝚍",
"𝚜𝚑𝚎 𝚠𝚎𝚊𝚛𝚜 𝚜𝚝𝚛𝚎𝚗𝚐𝚝𝚑 𝚊𝚗𝚍 𝚍𝚊𝚛𝚔𝚗𝚎𝚜𝚜 𝚎𝚚𝚞𝚊𝚕𝚕𝚢 𝚠𝚎𝚕𝚕",
"𝚒 𝚍𝚘𝚗’𝚝 𝚗𝚎𝚎𝚍 𝚊 𝚔𝚒𝚗𝚐 𝚝𝚘 𝚋𝚎 𝚊 𝚚𝚞𝚎𝚎𝚗",
"𝚜𝚑𝚎’𝚜 𝚑𝚎𝚕𝚕 𝚒𝚗 𝚑𝚎𝚎𝚕𝚜 𝚊𝚗𝚍 𝚑𝚎𝚊𝚟𝚎𝚗 𝚒𝚗 𝚑𝚎𝚛 𝚎𝚢𝚎𝚜",
"𝚖𝚢 𝚟𝚒𝚋𝚎 𝚒𝚜 𝚎𝚡𝚙𝚎𝚗𝚜𝚒𝚟𝚎",
"𝚒’𝚖 𝚗𝚘𝚝 𝚎� 𝚋𝚊𝚌𝚔𝚞𝚙 𝚙𝚕𝚊𝚗",
"𝚜𝚑𝚎 𝚝𝚞𝚛𝚗𝚎𝚍 𝚑𝚎𝚛 𝚌𝚊𝚗’𝚝𝚜 𝚒𝚗𝚝𝚘 𝚌𝚊𝚗𝚜 𝚊𝚗𝚍 𝚑𝚎𝚛 𝚍𝚛𝚎𝚊𝚖𝚜 𝚒𝚗𝚝𝚘 𝚙𝚕𝚊𝚗𝚜",
"𝚒 𝚊𝚖 𝚝𝚑𝚎 𝚍𝚎𝚜𝚒𝚐𝚗𝚎𝚛 𝚘𝚏 𝚖𝚢 𝚘𝚠𝚗 𝚌𝚊𝚝𝚊𝚜𝚝𝚛𝚘𝚙𝚑𝚎",
"𝚜𝚑𝚎’𝚜 𝚊 𝚏𝚕𝚊𝚖𝚎 𝚢𝚘𝚞 𝚌𝚊𝚗’𝚝 𝚙𝚞𝚝 𝚘𝚞𝚝",
"𝚒 𝚍𝚘𝚗’𝚝 𝚑𝚘𝚕𝚍 𝚐𝚛𝚞𝚍𝚐𝚎𝚜, 𝚒 𝚛𝚎𝚖𝚎𝚖𝚋𝚎𝚛 𝚏𝚊𝚌𝚝𝚜",
"𝚜𝚑𝚎 𝚒𝚜 𝚊𝚛𝚝 𝚒𝚗 𝚖𝚘𝚝𝚒𝚘𝚗",
"𝚒’𝚖 𝚗𝚘𝚝 𝚊𝚛𝚛𝚘𝚐𝚊𝚗𝚝, 𝚒’𝚖 𝚓𝚞𝚜𝚝 𝚊𝚠𝚊𝚛𝚎",
"𝚜𝚑𝚎 𝚕𝚘𝚟𝚎𝚍 𝚊 𝚕𝚒𝚝𝚝𝚕𝚎 𝚝𝚘𝚘 𝚑𝚊𝚛𝚍 𝚊𝚗𝚍 𝚕𝚎𝚊𝚛𝚗𝚎𝚍 𝚝𝚘 𝚕𝚘𝚟𝚎 𝚑𝚎𝚛𝚜𝚎𝚕𝚏 𝚖𝚘𝚛𝚎",
"𝚒 𝚊𝚖 𝚗𝚘𝚝 𝚠𝚑𝚊𝚝 𝚑𝚊𝚙𝚙𝚎𝚗𝚎𝚍 𝚝𝚘 𝚖𝚎, 𝚒 𝚊𝚖 𝚠𝚑𝚊𝚝 𝚒 𝚌𝚑𝚘𝚘𝚜𝚎 𝚝𝚘 𝚋𝚎𝚌𝚘𝚖𝚎",
"𝚜𝚑𝚎’𝚜 𝚝𝚑𝚎 𝚝𝚢𝚙𝚎 𝚘𝚏 𝚐𝚒𝚛𝚕 𝚝𝚑𝚊𝚝 𝚌𝚊𝚗 𝚋𝚎 𝚜𝚘 𝚑𝚞𝚛𝚝 𝚋𝚞𝚝 𝚜𝚝𝚒𝚕𝚕 𝚕𝚘𝚘𝚔 𝚊𝚝 𝚢𝚘𝚞 𝚊𝚗𝚍 𝚜𝚖𝚒𝚕𝚎",
"𝚒 𝚍𝚘𝚗’𝚝 𝚍𝚘 𝚍𝚛𝚊𝚖𝚊, 𝚒 𝚎𝚗𝚍 𝚒𝚝",
"𝚜𝚑𝚎 𝚠𝚎𝚊𝚛𝚜 𝚌𝚘𝚗𝚏𝚒𝚍𝚎𝚗𝚌𝚎 𝚕𝚒𝚔𝚎 𝚊 𝚌𝚛𝚘𝚠𝚗",
"𝚒’𝚖 𝚝𝚑𝚎 𝚐𝚒𝚛𝚕 𝚢𝚘𝚞𝚛 𝚎𝚡 𝚠𝚒𝚕𝚕 𝚑𝚊𝚝𝚎 𝚊𝚗𝚍 𝚢𝚘𝚞𝚛 𝚖𝚘𝚖 𝚠𝚒𝚕𝚕 𝚕𝚘𝚟𝚎",
"𝚜𝚑𝚎’𝚜 𝚊 𝚜𝚝𝚘𝚛𝚖 𝚠𝚒𝚝𝚑 𝚜𝚔𝚒𝚗",
"𝚒 𝚊𝚖 𝚝𝚝𝚑𝚎 𝚛𝚎𝚊𝚜𝚘𝚗 𝚝𝚑𝚎 𝚖𝚘𝚘𝚗 𝚕𝚘𝚘𝚔𝚜 𝚜𝚊𝚍 𝚝𝚘𝚗𝚒𝚐𝚑𝚝",
"𝚜𝚑𝚎 𝚒𝚜 𝚗𝚘𝚝 𝚊 𝚙𝚛𝚒𝚗𝚌𝚎𝚜𝚜, 𝚜𝚑𝚎 𝚒𝚜 𝚊 𝚔𝚒𝚗𝚐",
"𝚒 𝚍𝚘𝚗’𝚝 𝚛𝚒𝚜𝚎 𝚏𝚛𝚘𝚖 𝚝𝚑𝚎 𝚊𝚜𝚑𝚎𝚜, 𝚒 𝚖𝚊𝚔𝚎 𝚝𝚑𝚎𝚖",
"𝚜𝚑𝚎’𝚜 𝚊 𝚕𝚎𝚐𝚎𝚗𝚍 𝚠𝚒𝚝𝚑 𝚊 𝚍𝚊𝚛𝚔 𝚜𝚜𝚒𝚍𝚎",
"𝚒 𝚊𝚖 𝚝𝚑𝚎 𝚟𝚒𝚕𝚕𝚊𝚒𝚗 𝚘𝚏 𝚖𝚢 𝚘𝚠𝚗 𝚜𝚝𝚘𝚛𝚢",
"𝚜𝚑𝚎 𝚑𝚊𝚜 𝚏𝚒𝚛𝚎 𝚒𝚗 𝚑𝚎𝚛 𝚜𝚘𝚞𝚕 𝚊𝚗𝚍 𝚐𝚛𝚊𝚌𝚎 𝚒𝚗 𝚑𝚎𝚛 𝚑𝚎𝚊𝚛𝚝",
"𝚒 𝚊𝚖 𝚗𝚘𝚝 𝚙𝚎𝚛𝚏𝚎𝚌𝚝, 𝚒 𝚊𝚖 𝚘𝚛𝚒𝚐𝚒𝚗𝚊𝚕",
"𝚜𝚑𝚎 𝚒𝚜 𝚝𝚑𝚎 𝚔𝚒𝚗𝚍 𝚘𝚏 𝚖𝚊𝚐𝚒𝚌 𝚝𝚑𝚊𝚝 𝚝𝚞𝚛𝚗𝚜 𝚙𝚊𝚒𝚗 𝚒𝚗𝚝𝚘 𝚙𝚘𝚠𝚎𝚛",
"𝚒 𝚍𝚘𝚗’𝚝 𝚗𝚎𝚎𝚍 𝚢𝚘𝚞𝚛 𝚜𝚊𝚟𝚒𝚗𝚐, 𝚒’𝚖 𝚖𝚢 𝚘𝚠𝚗 𝚑𝚎𝚛𝚘",
"𝚜𝚑𝚎 𝚠𝚊𝚜 𝚗𝚎𝚟𝚎𝚛 𝚖𝚎𝚊𝚗𝚝 𝚝𝚘 𝚋𝚎 𝚞𝚗𝚍𝚎𝚛𝚜𝚝𝚘𝚘𝚍",
"𝚒 𝚊𝚖 𝚝𝚑𝚎 𝚐𝚒𝚛𝚕 𝚠𝚑𝚘 𝚖𝚊𝚍𝚎 𝚑𝚎𝚛 𝚘𝚠𝚗 𝚖𝚊𝚐𝚒𝚌",
"𝚜𝚑𝚎 𝚒𝚜 𝚋𝚎𝚊𝚞𝚝𝚒𝚏𝚞𝚕 𝚌𝚑𝚊𝚘𝚜 𝚊𝚗𝚍 𝚋𝚛𝚘𝚔𝚎𝚗 𝚎𝚕𝚎𝚐𝚊𝚗𝚌𝚎",
"𝚒 𝚊𝚖 𝚝𝚑𝚎 𝚍𝚛𝚎𝚊𝚖 𝚢𝚘𝚞 𝚌𝚊𝚗’𝚝 𝚠𝚊𝚔𝚎 𝚞𝚙 𝚏𝚛𝚘𝚖",
"𝚜𝚑𝚎 𝚒𝚜 𝚊 𝚏𝚕𝚘𝚠𝚎𝚛 𝚝𝚑𝚊𝚝 𝚐𝚛𝚎𝚠 𝚒𝚗 𝚌𝚘𝚗𝚌𝚛𝚎𝚝𝚎",
"𝚒 𝚊𝚖 𝚗𝚘𝚝 𝚑𝚎𝚛𝚎 𝚝𝚘 𝚏𝚒𝚝 𝚒𝚗, 𝚒’𝚖 𝚑𝚎𝚛𝚎 𝚝𝚘 𝚜𝚝𝚊𝚗𝚍 𝚘𝚞𝚝",
"𝚜𝚑𝚎 𝚒𝚜 𝚝𝚑𝚎 𝚖𝚘𝚘𝚗 — 𝚋𝚎𝚊𝚞𝚝𝚒𝚏𝚞𝚕, 𝚖𝚢𝚜𝚝𝚎𝚛𝚒𝚘𝚞𝚜, 𝚊𝚗𝚍 𝚊 𝚕𝚒𝚝𝚝𝚕𝚎 𝚋𝚛𝚘𝚔𝚎𝚗",
"𝚒 𝚊𝚖 𝚝𝚑𝚎 𝚐𝚒𝚛𝚕 𝚢𝚘𝚞 𝚠𝚒𝚕𝚕 𝚗𝚎𝚟𝚎𝚛 𝚏𝚘𝚛𝚐𝚎𝚝",
"𝚜𝚑𝚎 𝚒𝚜 𝚊 𝚠𝚘𝚛𝚔 𝚘𝚏 𝚊𝚛𝚝 — 𝚝𝚘𝚘 𝚎𝚡𝚙𝚎𝚗𝚜𝚒𝚟𝚎 𝚏𝚘𝚛 𝚢𝚘𝚞𝚛 𝚝𝚊𝚜𝚝𝚎",
"𝚒 𝚊𝚖 𝚝𝚑𝚎 𝚎𝚗𝚍𝚒𝚗𝚐 𝚢𝚘𝚞 𝚍𝚒𝚍𝚗’𝚝 𝚜𝚎𝚎 𝚌𝚘𝚖𝚒𝚗𝚐",
"𝚜𝚑𝚎 𝚑𝚊𝚜 𝚊 𝚜𝚘𝚞𝚕 𝚏𝚞𝚕𝚕 𝚘𝚏 𝚜𝚝𝚊𝚛𝚜 𝚊𝚗𝚍 𝚊 𝚑𝚎𝚊𝚛𝚝 𝚖𝚊𝚍𝚎 𝚘𝚏 𝚐𝚘𝚕𝚍",
"𝚒 𝚊𝚖 𝚗𝚘𝚝 𝚢𝚘𝚞𝚛 𝚜𝚎𝚌𝚘𝚗𝚍 𝚌𝚑𝚘𝚒𝚌𝚎",
"𝚜𝚑𝚎 𝚒𝚜 𝚊 𝚋𝚎𝚊𝚞𝚝𝚒𝚏𝚞𝚕 𝚍𝚒𝚜𝚊𝚜𝚝𝚎𝚛",
"𝚒 𝚊𝚖 𝚝𝚑𝚎 𝚐𝚒𝚛𝚕 𝚠𝚑𝚘 𝚝𝚞𝚛𝚗𝚎𝚍 𝚑𝚎𝚛 𝚜𝚌𝚊𝚛𝚜 𝚒𝚗𝚝𝚘 𝚜𝚝𝚊𝚛𝚜",
"𝚜𝚑𝚎 𝚒𝚜 𝚝𝚑𝚎 𝚔𝚒𝚗𝚍 𝚘𝚏 𝚖𝚊𝚐𝚒𝚌 𝚝𝚑𝚊𝚝 𝚕𝚎𝚊𝚟𝚎𝚜 𝚢𝚘𝚞 𝚜𝚙𝚎𝚎𝚌𝚑𝚕𝚎𝚜𝚜",
"𝚒 𝚊𝚖 𝚝𝚑𝚎 𝚟𝚒𝚋𝚎 𝚢𝚘𝚞 𝚌𝚊𝚗’𝚝 𝚛𝚎𝚙𝚕𝚊𝚌𝚎",
"𝚜𝚑𝚎 𝚒𝚜 𝚝𝚑𝚎 𝚛𝚎𝚊𝚜𝚘𝚗 𝚜𝚘𝚖𝚎 𝚗𝚒𝚐𝚑𝚝𝚜 𝚊𝚛𝚎 𝚋𝚎𝚝𝚝𝚎𝚛 𝚝𝚑𝚊𝚗 𝚍𝚛𝚎𝚊𝚖𝚜",
"𝚒 𝚊𝚖 𝚗𝚘𝚝 𝚊𝚗 𝚘𝚙𝚝𝚒𝚘𝚗, 𝚒 𝚊𝚖 𝚊 𝚙𝚛𝚒𝚘𝚛𝚒𝚝𝚢",
"𝚜𝚑𝚎 𝚒𝚜 𝚊 𝚠𝚑𝚘𝚕𝚎 𝚞𝚗𝚒𝚟𝚎𝚛𝚜𝚎 𝚒𝚗 𝚘𝚗𝚎 𝚐𝚒𝚛𝚕",
"𝚒 𝚊𝚖 𝚝𝚑𝚎 𝚐𝚒𝚛𝚕 𝚠𝚑𝚘 𝚠𝚊𝚕𝚔𝚜 𝚊𝚠𝚊𝚢 𝚠𝚒𝚝𝚑 𝚑𝚎𝚛 𝚑𝚎𝚊𝚍 𝚑𝚎𝚕𝚍 𝚑𝚒𝚐𝚑",
"𝚜𝚑𝚎 𝚒𝚜 𝚝𝚑𝚎 𝚜𝚝𝚘𝚛𝚢 𝚢𝚘𝚞 𝚠𝚒𝚜𝚑 𝚢𝚘𝚞 𝚌𝚘𝚞𝚕𝚍 𝚛𝚎𝚊𝚍 𝚝𝚠𝚒𝚌𝚎",
"𝚒 𝚊𝚖 𝚝𝚑𝚎 𝚎𝚗𝚍 𝚘𝚏 𝚢𝚘𝚞𝚛 𝚋𝚎𝚐𝚒𝚗𝚗𝚒𝚗𝚐",
"𝚜𝚑𝚎 𝚒𝚜 𝚊 𝚏𝚒𝚛𝚎𝚠𝚘𝚛𝚔 — 𝚋𝚎𝚊𝚞𝚝𝚒𝚏𝚞𝚕 𝚊𝚗𝚍 𝚍𝚊𝚗𝚐𝚎𝚛𝚘𝚞𝚜",
"𝚒 𝚒 𝚊𝚖 𝚝𝚑𝚎 𝚐𝚒𝚛𝚕 𝚢𝚘𝚞 𝚕𝚘𝚜𝚝 𝚝𝚘 𝚊 𝚋𝚎𝚝𝚝𝚎𝚛 𝚟𝚎𝚛𝚜𝚒𝚘𝚗 𝚘𝚏 𝚢𝚘𝚞𝚛𝚜𝚎𝚕𝚏",
"𝚜𝚑𝚎 𝚒𝚜 𝚝𝚑𝚎 𝚚𝚞𝚎𝚎𝚗 𝚘𝚏 𝚑𝚎𝚛 𝚘𝚠𝚗 𝚔𝚒𝚗𝚐𝚍𝚘𝚖"
  ];

  const randomImage = tips[Math.floor(Math.random() * tips.length)];
   var messa = await prepareWAMessageMedia({ image: { url:'https://files.catbox.moe/hrmmoz.jpg' } }, { upload: conn.waUploadToServer });
let msg = generateWAMessageFromContent(m.chat, {
  viewOnceMessage: {
    message: {
        "messageContextInfo": {
          "deviceListMetadata": {},
          "deviceListMetadataVersion": 2
        },
        interactiveMessage: proto.Message.InteractiveMessage.create({
          body: proto.Message.InteractiveMessage.Body.create({
            text: `> *${randomImage}*\n*── ⋆⋆ ── ⋆⋆ ── ⋆⋆ ── ⋆⋆ ── ⋆⋆*`
          }),
          footer: proto.Message.InteractiveMessage.Footer.create({
            text: "𝙰𝚁𝚃_𝙱𝙾𝚃"
          }),
          header: proto.Message.InteractiveMessage.Header.create({
            title: "*── ⋆⋆ ── ⋆⋆ ── ⋆⋆ ── ⋆⋆ ── ⋆⋆*",
            subtitle: "بوست",
            hasMediaAttachment: true, 
            imageMessage: messa.imageMessage, 
          }),
          nativeFlowMessage: proto.Message.InteractiveMessage.NativeFlowMessage.create({
            buttons: [
              {
               name: "quick_reply",
               buttonParamsJson:JSON.stringify({
                 "display_text":"التالي","id":".بوست" 
                })
               }, 
              {
                "name": "quick_reply",
                "buttonParamsJson": "{\"display_text\":\"الدعم\",\"id\":\".الدعم\"}"
               } 
              ],
          })
        })
    }
  }
}, {})

await conn.relayMessage(msg.key.remoteJid, msg.message, { messageId: msg.key.id })

} 
handler.tags = ['frasss'];
handler.command = ['bio','بايو'];
export default handler;