let handler = async (m, { command, text }) => m.reply(`> *قوانــــ📃ـــين⇇｢𝙰𝚁𝚃𝙷𝚄𝚁_𝙱𝙾𝚃｣↶*
*⧈─╼━╾╼━┇•❄️•┇━╾─╼╾─⧈*
*⌬هذه القوانين يجب إتباعها وإذا تم مخالفتها تعطي العقوبات علي حسب تقدير المشرف*

*⧉↫مخالفات التنبيه↶*
*①⏎التكلم بأي لغه غير اللغه العربية*
*②⏎ مضايقه الأعضاء*
*③⏎ الرسائل الصوتية المزعجة*
*④⏎ الرسائل التافهه*
*⑤⏎يستطيع المشرف إعطائك تنبيه غير مدون في القوانين إذا لزم الامر*
 *⑥⏎تنبيهين =انذار*
*⧈─╼━╾╼━┇•❄️•┇━╾─╼╾─⧈*
*⧉↫مخالفات الإنذار↶*
*①⏎الحرق المتعمد*
*②⏎الإعتراض علي قرار مشرف*
*③⏎إرسال 5 رسائل ورا بعض بدون فائدة*
*④⏎التحدث عن الهانتاي*
*⑤⏎ التشفير+ قد يتضاعف*
*⑥⏎ ⏎الإيمــــــــوجيـــات* 
【💋👄🫦】
*⧈─╼━╾╼━┇•❄️•┇━╾─╼╾─⧈*
*⧉↫مخالفات الإنذارين↶*
*①⏎الـتحدث مع فتاة بدون إذنها ب الـخاص*
*②⏎الـصور الشـخصية*
*③⏎الـتحدث بالفاظ بذيئـة قد يتضـاعف لاإنـذارين*
*④⏎الـتنمر الذي قد يسبب مشاكل*
*⑤ ⏎التحدث في السياسة*
*⑥⏎الـتكلم بـإمور الـدين*
*⑦⏎نشر حسـابات شخصية بغرض المتابعةه بكافة أشكالها*
*⑧⏎الـتحدث عن الأمور المحرمة [المخدرات-الخمور-القتل-الدم-السحر...الخ]*
*⑨⏎الـتحدث عن نقابات وممالك أخرى أو النشر لها قد يقودك للطرد بحسب قرار المشرف*
*⧈─╼━╾╼━┇•❄️•┇━╾─╼╾─⧈*
*⧉↫مخالفات التأديبي↶*
*①⏎تهـديد عضو ب البـاند*
*②⏎السب ب التشفير*
*③⏎إهـانه مشرف أو شتمة أو الـتقليل من قيمته*
*④⏎3إنـذارات*
*⑤⏎ممنوع التطقيمات المخلة*
*⑥⏎ممنوع الإيمــــــــوجيـــات دي 「🏳‍🌈🇮🇱🐑💩」*
*⑦⏎ذكر الأهل تتراوح العقوبة من تأديبي إسبوع إلى مؤبد* 
*⧈─╼━╾╼━┇•❄️•┇━╾─╼╾─⧈*
*⧉↫مخالفات المؤبد↶*
*①⏎شتم عضو أو مشرف بطريقة مبـاشرة*
*②⏎سب الديـن/أو الـسيـاسة بشكل عام*
*③⏎سـرقةه أعضاء/ نشر روابط*
*④⏎السب/الشتم أو إرسال إيموجيات/وسائط تحتوي على أي شيء فاحش أو تلمح له*
*⑤⏎الإحتكاك في الجنس الآخر*
*⧈─╼━╾╼━┇•❄️•┇━╾─╼╾─⧈*
*┊❄️┊البوت:•⪼𝙰𝚁𝚃𝙷𝚄𝚁_𝙱𝙾𝚃*
*┊❄️┊⇦تـوقـيــــ؏⇇𝙰𝚁𝚃𝙷𝚄𝚁_𝙱𝙾𝚃* `.trim(), null, m.mentionedJid ? {
  mentions: m.mentionedJid
} : {})

handler.help = ['الاوامر <teks>?']
handler.tags = ['الاوامر', 'fun']
handler.command = /^(قوانين|rule|القوانين|القواعد)$/i

export default handler